*** src/mission_launch.rs:1648:5: replace lazy_start_phase_for_step -> bool with false

*** mutation diff:
--- src/mission_launch.rs
+++ replace lazy_start_phase_for_step -> bool with false
@@ -1640,39 +1640,17 @@
 /// [`lazy_close_prior_phases`]). `false` on every later step of an
 /// already-started phase, so the advance fires exactly once per band.
 pub(crate) fn lazy_start_phase_for_step(
     mission_id: &str,
     phase_id: &str,
     step_status: crew::types::NodeStatus,
     started: &mut std::collections::HashSet<String>,
 ) -> bool {
-    use crew::types::NodeStatus;
-    if step_status != NodeStatus::Running {
-        return false;
-    }
-    if phase_id.is_empty() || !started.insert(phase_id.to_string()) {
-        return false;
-    }
-    let status = load_phase_for_brief(mission_id, phase_id)
-        .map(|p| p.status)
-        .unwrap_or(PhaseStatus::Planned);
-    if matches!(status, PhaseStatus::Planned | PhaseStatus::Abandoned) {
-        if let Err(e) = crew::lifecycle::phase_start(phase_id) {
-            eprintln!(
-                "{}",
-                style::dim(&format!(
-                    "mission launch: phase_start({phase_id}) failed: {e:#} — continuing; the \
-                     whole-mission terminal (`mission finalize` / `mission abort`) reconciles \
-                     phase state."
-                ))
-            );
-        }
-    }
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// (#1620) The counterpart to [`lazy_start_phase_for_step`]: close the phases
 /// a newly-started one has moved past.
 ///
 /// Without this, a launcher that starts phases lazily never CLOSES them, so
 /// every phase it touched sat `Running` until the whole mission finalized and
 /// reconciled them in bulk. The board counts `Complete` phases, so a review

---- mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances stdout ----

thread 'mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances' (156410426) panicked at src/mission_launch.rs:3040:9:
assertion failed: lazy_start_phase_for_step(mission_id, &order[0], NodeStatus::Running,
    &mut started)

---- mission_launch::tests::lazy_start_phase_for_step_is_idempotent_for_a_multi_step_phase stdout ----

thread 'mission_launch::tests::lazy_start_phase_for_step_is_idempotent_for_a_multi_step_phase' (156410677) panicked at src/mission_launch.rs:3134:9:
assertion `left == right` failed
  left: Planned
 right: Running

---- mission_launch::tests::lazy_start_phase_for_step_only_starts_the_phase_its_step_belongs_to stdout ----

thread 'mission_launch::tests::lazy_start_phase_for_step_only_starts_the_phase_its_step_belongs_to' (156410694) panicked at src/mission_launch.rs:3097:9:
assertion `left == right` failed: p1 starts on its own first step
  left: Planned
 right: Running

failures:
    mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances
    mission_launch::tests::lazy_start_phase_for_step_is_idempotent_for_a_multi_step_phase
    mission_launch::tests::lazy_start_phase_for_step_only_starts_the_phase_its_step_belongs_to
    mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it
    mission_launch_review::tests::review_phases_start_lazily_not_all_at_mint

test result: FAILED. 397 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 11.75s

*** result: Failure(101)
