*** src/mission_launch.rs:1649:20: replace != with == in lazy_start_phase_for_step

*** mutation diff:
--- src/mission_launch.rs
+++ replace != with == in lazy_start_phase_for_step
@@ -1641,17 +1641,17 @@
 /// already-started phase, so the advance fires exactly once per band.
 pub(crate) fn lazy_start_phase_for_step(
     mission_id: &str,
     phase_id: &str,
     step_status: crew::types::NodeStatus,
     started: &mut std::collections::HashSet<String>,
 ) -> bool {
     use crew::types::NodeStatus;
-    if step_status != NodeStatus::Running {
+    if step_status == /* ~ changed by cargo-mutants ~ */ NodeStatus::Running {
         return false;
     }
     if phase_id.is_empty() || !started.insert(phase_id.to_string()) {
         return false;
     }
     let status = load_phase_for_brief(mission_id, phase_id)
         .map(|p| p.status)
         .unwrap_or(PhaseStatus::Planned);

---- mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances stdout ----

thread 'mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances' (156390391) panicked at src/mission_launch.rs:3062:9:
assertion failed: lazy_start_phase_for_step(mission_id, &order[0], NodeStatus::Running,
    &mut started)

---- mission_launch::tests::lazy_start_phase_for_step_only_starts_the_phase_its_step_belongs_to stdout ----

thread 'mission_launch::tests::lazy_start_phase_for_step_only_starts_the_phase_its_step_belongs_to' (156390573) panicked at src/mission_launch.rs:3119:9:
assertion `left == right` failed: p1 starts on its own first step
  left: Planned
 right: Running

---- mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it stdout ----

thread 'mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it' (156391027) panicked at src/mission_launch_review.rs:1872:9:
assertion failed: mission_launch::lazy_start_phase_for_step(&mission_id, &order[0],
    crew::types::NodeStatus::Running, &mut started)

failures:
    mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances
    mission_launch::tests::lazy_start_phase_for_step_is_idempotent_for_a_multi_step_phase
    mission_launch::tests::lazy_start_phase_for_step_only_starts_the_phase_its_step_belongs_to
    mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it
    mission_launch_review::tests::review_phases_start_lazily_not_all_at_mint

test result: FAILED. 397 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.72s

*** result: Failure(101)
