*** src/mission_launch.rs:1652:31: delete ! in lazy_start_phase_for_step

*** mutation diff:
--- src/mission_launch.rs
+++ delete ! in lazy_start_phase_for_step
@@ -1644,17 +1644,17 @@
     phase_id: &str,
     step_status: crew::types::NodeStatus,
     started: &mut std::collections::HashSet<String>,
 ) -> bool {
     use crew::types::NodeStatus;
     if step_status != NodeStatus::Running {
         return false;
     }
-    if phase_id.is_empty() || !started.insert(phase_id.to_string()) {
+    if phase_id.is_empty() ||  /* ~ changed by cargo-mutants ~ */started.insert(phase_id.to_string()) {
         return false;
     }
     let status = load_phase_for_brief(mission_id, phase_id)
         .map(|p| p.status)
         .unwrap_or(PhaseStatus::Planned);
     if matches!(status, PhaseStatus::Planned | PhaseStatus::Abandoned) {
         if let Err(e) = crew::lifecycle::phase_start(phase_id) {
             eprintln!(

---- mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances stdout ----

thread 'mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances' (156417625) panicked at src/mission_launch.rs:3062:9:
assertion failed: lazy_start_phase_for_step(mission_id, &order[0], NodeStatus::Running,
    &mut started)

---- mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it stdout ----

thread 'mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it' (156418472) panicked at src/mission_launch_review.rs:1872:9:
assertion failed: mission_launch::lazy_start_phase_for_step(&mission_id, &order[0],
    crew::types::NodeStatus::Running, &mut started)

---- mission_launch::tests::lazy_start_phase_for_step_only_starts_the_phase_its_step_belongs_to stdout ----

thread 'mission_launch::tests::lazy_start_phase_for_step_only_starts_the_phase_its_step_belongs_to' (156417859) panicked at src/mission_launch.rs:3119:9:
assertion `left == right` failed: p1 starts on its own first step
  left: Planned
 right: Running

failures:
    mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances
    mission_launch::tests::lazy_start_phase_for_step_only_starts_the_phase_its_step_belongs_to
    mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it
    mission_launch_review::tests::review_phases_start_lazily_not_all_at_mint

test result: FAILED. 398 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.29s

*** result: Failure(101)
