*** src/mission_launch.rs:1701:5: replace lazy_close_prior_phases with ()

*** mutation diff:
--- src/mission_launch.rs
+++ replace lazy_close_prior_phases with ()
@@ -1693,65 +1693,17 @@
 /// principle overlap bands, and an early wrong `Abandoned` is far worse than a
 /// late-but-correct one — finalize still reconciles whatever this skips.
 pub(crate) fn lazy_close_prior_phases(
     mission_id: &str,
     phase_order: &[String],
     newly_started: &str,
     closed: &mut std::collections::HashSet<String>,
 ) {
-    use crew::types::NodeStatus;
-    let Some(at) = phase_order.iter().position(|p| p == newly_started) else {
-        return;
-    };
-    for prior in &phase_order[..at] {
-        if !closed.insert(prior.clone()) {
-            continue;
-        }
-        let status = load_phase_for_brief(mission_id, prior).map(|p| p.status);
-        if !matches!(status, Ok(PhaseStatus::Running)) {
-            continue;
-        }
-        let Ok(steps) = crew::lifecycle::load_steps_for_phase(mission_id, prior) else {
-            closed.remove(prior);
-            continue;
-        };
-        // (#1620) NO steps on disk is absence of evidence, not evidence of
-        // failure — and `phase_finalization` reads an empty slice as "the
-        // scheduler never reached this phase", i.e. Abandoned. Deriving a
-        // verdict from nothing is the same defect as rendering an unknown run
-        // as `running` (#1621); it just fails in the pessimistic direction.
-        // Caught by `advancing_a_phase_closes_the_ones_before_it`, which
-        // abandoned a healthy phase on the first advance.
-        //
-        // Likewise a phase with any step still live is not ours to close.
-        // Both cases defer to finalize, which reconciles with full information.
-        if steps.is_empty()
-            || steps.iter().any(|s| matches!(s.status, NodeStatus::Planned | NodeStatus::Running))
-        {
-            closed.remove(prior);
-            continue;
-        }
-        let refs: Vec<&crew::types::Step> = steps.iter().collect();
-        let (outcome, _reason) = phase_finalization(&refs);
-        let result = match outcome {
-            crew::envelope::PhaseOutcomeKind::Complete => crew::lifecycle::phase_complete(prior),
-            _ => crew::lifecycle::phase_abandon(prior),
-        };
-        if let Err(e) = result {
-            closed.remove(prior);
-            eprintln!(
-                "{}",
-                style::dim(&format!(
-                    "mission launch: closing phase `{prior}` on advance failed: {e:#} — \
-                     continuing; the whole-mission terminal reconciles phase state."
-                ))
-            );
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// (#1406) Derive each executed phase's finalization outcome from THAT
 /// phase's OWN step statuses, rather than stamping every phase with one
 /// uniform run-level outcome. The old uniform mapping marked a never-started
 /// (`Planned`) phase `Complete` on a `Degraded` run; `finalize_mission` then
 /// called `phase_complete` on a `Planned` phase, which the state machine
 /// refuses, leaving a Finalized mission with a permanently `Planned` phase whose

---- mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances stdout ----

thread 'mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances' (156419364) panicked at src/mission_launch.rs:3037:9:
assertion `left == right` failed: advancing must CLOSE the band behind it — two Running phases contradicts #1341
  left: 2
 right: 1

---- mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it stdout ----

thread 'mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it' (156419887) panicked at src/mission_launch_review.rs:1909:9:
assertion `left == right` failed: investigate must close when adjudicate is live — phases are strictly linear (#1341), so reaching one means the earlier ones are over
  left: "running"
 right: "complete"

failures:
    mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances
    mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it

test result: FAILED. 400 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.58s

*** result: Failure(101)
