*** src/mission_launch.rs:1702:54: replace == with != in lazy_close_prior_phases

*** mutation diff:
--- src/mission_launch.rs
+++ replace == with != in lazy_close_prior_phases
@@ -1694,17 +1694,17 @@
 /// late-but-correct one — finalize still reconciles whatever this skips.
 pub(crate) fn lazy_close_prior_phases(
     mission_id: &str,
     phase_order: &[String],
     newly_started: &str,
     closed: &mut std::collections::HashSet<String>,
 ) {
     use crew::types::NodeStatus;
-    let Some(at) = phase_order.iter().position(|p| p == newly_started) else {
+    let Some(at) = phase_order.iter().position(|p| p != /* ~ changed by cargo-mutants ~ */ newly_started) else {
         return;
     };
     for prior in &phase_order[..at] {
         if !closed.insert(prior.clone()) {
             continue;
         }
         let status = load_phase_for_brief(mission_id, prior).map(|p| p.status);
         if !matches!(status, Ok(PhaseStatus::Running)) {

---- mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances stdout ----

thread 'mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances' (156419648) panicked at src/mission_launch.rs:3085:9:
assertion `left == right` failed: advancing must CLOSE the band behind it — two Running phases contradicts #1341
  left: 2
 right: 1

---- mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it stdout ----

thread 'mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it' (156420027) panicked at src/mission_launch_review.rs:1909:9:
assertion `left == right` failed: investigate must close when adjudicate is live — phases are strictly linear (#1341), so reaching one means the earlier ones are over
  left: "running"
 right: "complete"

failures:
    mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances
    mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it

test result: FAILED. 400 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.07s

*** result: Failure(101)
