*** src/mission_launch.rs:1728:13: replace || with && in lazy_close_prior_phases

*** mutation diff:
--- src/mission_launch.rs
+++ replace || with && in lazy_close_prior_phases
@@ -1720,17 +1720,17 @@
         // verdict from nothing is the same defect as rendering an unknown run
         // as `running` (#1621); it just fails in the pessimistic direction.
         // Caught by `advancing_a_phase_closes_the_ones_before_it`, which
         // abandoned a healthy phase on the first advance.
         //
         // Likewise a phase with any step still live is not ours to close.
         // Both cases defer to finalize, which reconciles with full information.
         if steps.is_empty()
-            || steps.iter().any(|s| matches!(s.status, NodeStatus::Planned | NodeStatus::Running))
+            && /* ~ changed by cargo-mutants ~ */ steps.iter().any(|s| matches!(s.status, NodeStatus::Planned | NodeStatus::Running))
         {
             closed.remove(prior);
             continue;
         }
         let refs: Vec<&crew::types::Step> = steps.iter().collect();
         let (outcome, _reason) = phase_finalization(&refs);
         let result = match outcome {
             crew::envelope::PhaseOutcomeKind::Complete => crew::lifecycle::phase_complete(prior),

---- mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it stdout ----

thread 'mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it' (156427309) panicked at src/mission_launch_review.rs:1909:9:
assertion `left == right` failed: investigate must close when adjudicate is live — phases are strictly linear (#1341), so reaching one means the earlier ones are over
  left: "abandoned"
 right: "complete"

failures:
    mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it

test result: FAILED. 401 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.21s

*** result: Failure(101)
