*** src/mission_launch.rs:1736:13: delete match arm crew::envelope::PhaseOutcomeKind::Complete in lazy_close_prior_phases

*** mutation diff:
--- src/mission_launch.rs
+++ delete match arm crew::envelope::PhaseOutcomeKind::Complete in lazy_close_prior_phases
@@ -1728,17 +1728,17 @@
             || steps.iter().any(|s| matches!(s.status, NodeStatus::Planned | NodeStatus::Running))
         {
             closed.remove(prior);
             continue;
         }
         let refs: Vec<&crew::types::Step> = steps.iter().collect();
         let (outcome, _reason) = phase_finalization(&refs);
         let result = match outcome {
-            crew::envelope::PhaseOutcomeKind::Complete => crew::lifecycle::phase_complete(prior),
+             /* ~ changed by cargo-mutants ~ */
             _ => crew::lifecycle::phase_abandon(prior),
         };
         if let Err(e) = result {
             closed.remove(prior);
             eprintln!(
                 "{}",
                 style::dim(&format!(
                     "mission launch: closing phase `{prior}` on advance failed: {e:#} — \

---- mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances stdout ----

thread 'mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances' (156433765) panicked at src/mission_launch.rs:3090:9:
assertion `left == right` failed: and the closed band keeps the outcome it earned
  left: Abandoned
 right: Complete

---- mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it stdout ----

thread 'mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it' (156434780) panicked at src/mission_launch_review.rs:1909:9:
assertion `left == right` failed: investigate must close when adjudicate is live — phases are strictly linear (#1341), so reaching one means the earlier ones are over
  left: "abandoned"
 right: "complete"

failures:
    mission_launch::tests::at_most_one_phase_is_running_as_a_generic_mission_advances
    mission_launch_review::tests::advancing_a_phase_closes_the_ones_before_it

test result: FAILED. 400 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.01s

*** result: Failure(101)
