*** src/mission_launch.rs:935:25: delete field role_id from struct TaskOverride expression in build_launch_params

*** mutation diff:
--- src/mission_launch.rs
+++ delete field role_id from struct TaskOverride expression in build_launch_params
@@ -927,17 +927,17 @@
         // renamed task in a copied config still receives its overrides.
         let coder_task = task_id_declaring_step_kind(config, "mission.coder");
         let verify_task = task_id_declaring_step_kind(config, "mission.verify");
         if let Some(coder_task) = coder_task {
             if let Some(role) = role {
                 task_overrides.insert(
                     coder_task,
                     TaskOverride {
-                        role_id: Some(role.to_string()),
+                         /* ~ changed by cargo-mutants ~ */
                         workdir: workdir.clone(),
                         image: image.map(String::from),
                         description: Some(format!("dispatch `{role}` into the worktree")),
                         ..Default::default()
                     },
                 );
             } else if workdir.is_some() || image.is_some() {
                 task_overrides.insert(

---- mission_launch::tests::task_overrides_reach_a_renamed_coder_phase_config stdout ----

thread 'mission_launch::tests::task_overrides_reach_a_renamed_coder_phase_config' (156318406) panicked at src/mission_launch.rs:2980:9:
assertion `left == right` failed
  left: None
 right: Some("coder")

failures:
    mission_launch::tests::task_overrides_reach_a_renamed_coder_phase_config

test result: FAILED. 401 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.14s

*** result: Failure(101)
