*** src/mission_launch.rs:938:25: delete field description from struct TaskOverride expression in build_launch_params

*** mutation diff:
--- src/mission_launch.rs
+++ delete field description from struct TaskOverride expression in build_launch_params
@@ -930,17 +930,17 @@
         if let Some(coder_task) = coder_task {
             if let Some(role) = role {
                 task_overrides.insert(
                     coder_task,
                     TaskOverride {
                         role_id: Some(role.to_string()),
                         workdir: workdir.clone(),
                         image: image.map(String::from),
-                        description: Some(format!("dispatch `{role}` into the worktree")),
+                         /* ~ changed by cargo-mutants ~ */
                         ..Default::default()
                     },
                 );
             } else if workdir.is_some() || image.is_some() {
                 task_overrides.insert(
                     coder_task,
                     TaskOverride { workdir: workdir.clone(), image: image.map(String::from), ..Default::default() },
                 );

*** result: Success
