*** src/mission_launch.rs:950:63: delete field workdir from struct TaskOverride expression in build_launch_params

*** mutation diff:
--- src/mission_launch.rs
+++ delete field workdir from struct TaskOverride expression in build_launch_params
@@ -942,17 +942,17 @@
             } else if workdir.is_some() || image.is_some() {
                 task_overrides.insert(
                     coder_task,
                     TaskOverride { workdir: workdir.clone(), image: image.map(String::from), ..Default::default() },
                 );
             }
         }
         if let (Some(workdir), Some(verify_task)) = (workdir, verify_task) {
-            task_overrides.insert(verify_task, TaskOverride { workdir: Some(workdir), ..Default::default() });
+            task_overrides.insert(verify_task, TaskOverride {  /* ~ changed by cargo-mutants ~ */ ..Default::default() });
         }
     }
 
     LaunchParams {
         phase_ids: real_phase_ids.clone(),
         task_overrides,
         step_config_overrides: BTreeMap::new(),
         expansions: BTreeMap::new(),

---- mission_launch::tests::task_overrides_reach_a_renamed_coder_phase_config stdout ----

thread 'mission_launch::tests::task_overrides_reach_a_renamed_coder_phase_config' (156401142) panicked at src/mission_launch.rs:2988:9:
assertion `left == right` failed
  left: None
 right: Some("/tmp/some-other-tree")

failures:
    mission_launch::tests::task_overrides_reach_a_renamed_coder_phase_config

test result: FAILED. 401 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 13.61s

*** result: Failure(101)
