*** src/mission_status.rs:129:5: replace display_label -> &str with ""

*** mutation diff:
--- src/mission_status.rs
+++ replace display_label -> &str with ""
@@ -121,21 +121,17 @@
 /// glyph already distinguishes a single-role dispatch from a graph, so it is
 /// stripped. The id is not lost: the row is an OSC 8 link, so it is one click
 /// away, and any row that needs an id typed carries it verbatim in the drift
 /// suggestion printed directly beneath it.
 ///
 /// Falls back to the id when a description is genuinely absent — an id is a
 /// poor label but never a wrong one.
 fn display_label(m: &Mission) -> &str {
-    let d = m.description.trim();
-    if d.is_empty() {
-        return &m.id;
-    }
-    d.strip_prefix("dispatch: ").unwrap_or(d)
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 /// (#1612) Single-role dispatch vs multi-phase graph, in one column-safe glyph.
 ///
 /// The operator asked whether a row could say "graph" versus "role" and floated
 /// an emoji. Emoji are DOUBLE-WIDTH, and every column budget in this module is
 /// exact arithmetic over `chars().count()` — one emoji would silently overflow
 /// every row it appeared on. These two are single-width, so the distinction is

---- mission_status::tests::below_the_id_floor_the_row_overflows_by_design_but_stays_bounded stdout ----

thread 'mission_status::tests::below_the_id_floor_the_row_overflows_by_design_but_stays_bounded' (156274868) panicked at src/mission_status.rs:1265:13:
assertion `left == right` failed: at COLUMNS=22
  left: 0
 right: 12

---- mission_status::tests::display_label_prefers_the_description_and_drops_the_dispatch_prefix stdout ----

thread 'mission_status::tests::display_label_prefers_the_description_and_drops_the_dispatch_prefix' (156274872) panicked at src/mission_status.rs:1324:9:
assertion `left == right` failed
  left: ""
 right: "code-reviewer"

---- mission_status::tests::plan_layout_drops_the_handle_before_truncating_the_name stdout ----

thread 'mission_status::tests::plan_layout_drops_the_handle_before_truncating_the_name' (156274886) panicked at src/mission_status.rs:1409:9:
assertion failed: l.name_width < name_cols

failures:
    mission_status::tests::below_the_id_floor_the_row_overflows_by_design_but_stays_bounded
    mission_status::tests::display_label_prefers_the_description_and_drops_the_dispatch_prefix
    mission_status::tests::plan_layout_drops_the_handle_before_truncating_the_name
    mission_status::tests::plan_layout_shows_everything_when_output_is_not_a_terminal
    mission_status::tests::plan_layout_sizes_the_id_column_to_the_widest_shown_row
    mission_status::tests::plan_layout_truncates_the_id_only_when_even_that_cannot_fit

test result: FAILED. 396 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.74s

*** result: Failure(101)
