*** src/mission_status.rs:144:5: replace kind_glyph -> &'static str with ""

*** mutation diff:
--- src/mission_status.rs
+++ replace kind_glyph -> &'static str with ""
@@ -136,21 +136,17 @@
 /// (#1612) Single-role dispatch vs multi-phase graph, in one column-safe glyph.
 ///
 /// The operator asked whether a row could say "graph" versus "role" and floated
 /// an emoji. Emoji are DOUBLE-WIDTH, and every column budget in this module is
 /// exact arithmetic over `chars().count()` — one emoji would silently overflow
 /// every row it appeared on. These two are single-width, so the distinction is
 /// free: it costs no column at all, replacing a marker that was already there.
 fn kind_glyph(total_phases: usize) -> &'static str {
-    if total_phases > 1 {
-        "◆"
-    } else {
-        "•"
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 /// (#1612) A stable short handle for a mission, or `None` when the id has no
 /// discriminating token.
 ///
 /// The operator's ask was "a number" — something short that tells two otherwise
 /// identical rows apart. Both minting paths already end in one: `mint_run_id`
 /// emits `<config>-<secs>-<hex6>` (`review-1785400940-136e76`), and the older

---- mission_status::tests::below_the_id_floor_the_row_overflows_by_design_but_stays_bounded stdout ----

thread 'mission_status::tests::below_the_id_floor_the_row_overflows_by_design_but_stays_bounded' (156279751) panicked at src/mission_status.rs:1268:13:
assertion `left == right` failed: at COLUMNS=1 overflow must stay bounded
  left: 33
 right: 34

---- mission_status::tests::kind_glyph_separates_graphs_from_single_role_dispatches stdout ----

thread 'mission_status::tests::kind_glyph_separates_graphs_from_single_role_dispatches' (156279762) panicked at src/mission_status.rs:1378:9:
assertion `left == right` failed
  left: ""
 right: "◆"

failures:
    mission_status::tests::below_the_id_floor_the_row_overflows_by_design_but_stays_bounded
    mission_status::tests::kind_glyph_separates_graphs_from_single_role_dispatches

test result: FAILED. 400 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.89s

*** result: Failure(101)
