*** src/mission_status.rs:144:5: replace kind_glyph -> &'static str with "xyzzy"

*** mutation diff:
--- src/mission_status.rs
+++ replace kind_glyph -> &'static str with "xyzzy"
@@ -136,21 +136,17 @@
 /// (#1612) Single-role dispatch vs multi-phase graph, in one column-safe glyph.
 ///
 /// The operator asked whether a row could say "graph" versus "role" and floated
 /// an emoji. Emoji are DOUBLE-WIDTH, and every column budget in this module is
 /// exact arithmetic over `chars().count()` — one emoji would silently overflow
 /// every row it appeared on. These two are single-width, so the distinction is
 /// free: it costs no column at all, replacing a marker that was already there.
 fn kind_glyph(total_phases: usize) -> &'static str {
-    if total_phases > 1 {
-        "◆"
-    } else {
-        "•"
-    }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 /// (#1612) A stable short handle for a mission, or `None` when the id has no
 /// discriminating token.
 ///
 /// The operator's ask was "a number" — something short that tells two otherwise
 /// identical rows apart. Both minting paths already end in one: `mint_run_id`
 /// emits `<config>-<secs>-<hex6>` (`review-1785400940-136e76`), and the older

---- mission_status::tests::below_the_id_floor_the_row_overflows_by_design_but_stays_bounded stdout ----

thread 'mission_status::tests::below_the_id_floor_the_row_overflows_by_design_but_stays_bounded' (156282261) panicked at src/mission_status.rs:1268:13:
assertion `left == right` failed: at COLUMNS=1 overflow must stay bounded
  left: 38
 right: 34

---- mission_status::tests::kind_glyph_separates_graphs_from_single_role_dispatches stdout ----

thread 'mission_status::tests::kind_glyph_separates_graphs_from_single_role_dispatches' (156282272) panicked at src/mission_status.rs:1378:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "◆"

---- mission_status::tests::plan_layout_row_fits_every_width_it_can_honor stdout ----

thread 'mission_status::tests::plan_layout_row_fits_every_width_it_can_honor' (156282287) panicked at src/mission_status.rs:1248:13:
at COLUMNS=34 the row rendered 38 cols (show_mix=false): "  xyzzy m-0123456789   9d    2/3  ▓▓▓░"

failures:
    mission_status::tests::below_the_id_floor_the_row_overflows_by_design_but_stays_bounded
    mission_status::tests::kind_glyph_separates_graphs_from_single_role_dispatches
    mission_status::tests::plan_layout_row_fits_every_width_it_can_honor

test result: FAILED. 399 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.06s

*** result: Failure(101)
