*** src/mission_status.rs:165:5: replace short_handle -> Option<&str> with Some("xyzzy")

*** mutation diff:
--- src/mission_status.rs
+++ replace short_handle -> Option<&str> with Some("xyzzy")
@@ -157,19 +157,17 @@
 /// dispatch path emits `dispatch-<role>-<secs>-<hex>-<n>`.
 ///
 /// So: scan segments right-to-left for the first all-hex run of at least
 /// `MIN_HANDLE_HEX` chars. A HEURISTIC, deliberately — the two formats are not
 /// one, and hand-authored ids (`doom-loop-m4`, `104-daemon-observability`) match
 /// nothing and correctly yield `None`. It is display-only and drops to nothing
 /// on no match, so a wrong guess costs a column, never correctness.
 fn short_handle(id: &str) -> Option<&str> {
-    id.rsplit('-').find(|seg| {
-        seg.len() >= MIN_HANDLE_HEX && seg.chars().all(|c| c.is_ascii_hexdigit())
-    })
+    Some("xyzzy") /* ~ changed by cargo-mutants ~ */
 }
 
 /// Shortest run of hex that reads as a deliberate discriminator rather than an
 /// accident. Below 4, ordinary id fragments (`-0`, `-5`, a version `-2`) start
 /// matching and the column fills with noise.
 const MIN_HANDLE_HEX: usize = 4;
 
 /// (#1612) Compact "how long ago", in at most `AGE_COLS` columns.

---- mission_status::tests::plan_layout_plans_no_handle_column_when_no_row_has_one stdout ----

thread 'mission_status::tests::plan_layout_plans_no_handle_column_when_no_row_has_one' (156297001) panicked at src/mission_status.rs:1420:9:
assertion failed: !l.show_handle

---- mission_status::tests::short_handle_finds_the_mint_discriminator_or_nothing stdout ----

thread 'mission_status::tests::short_handle_finds_the_mint_discriminator_or_nothing' (156297010) panicked at src/mission_status.rs:1341:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("136e76")

failures:
    mission_status::tests::plan_layout_plans_no_handle_column_when_no_row_has_one
    mission_status::tests::short_handle_finds_the_mint_discriminator_or_nothing

test result: FAILED. 400 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.56s

*** result: Failure(101)
