*** src/mission_status.rs:166:19: replace >= with < in short_handle

*** mutation diff:
--- src/mission_status.rs
+++ replace >= with < in short_handle
@@ -158,17 +158,17 @@
 ///
 /// So: scan segments right-to-left for the first all-hex run of at least
 /// `MIN_HANDLE_HEX` chars. A HEURISTIC, deliberately — the two formats are not
 /// one, and hand-authored ids (`doom-loop-m4`, `104-daemon-observability`) match
 /// nothing and correctly yield `None`. It is display-only and drops to nothing
 /// on no match, so a wrong guess costs a column, never correctness.
 fn short_handle(id: &str) -> Option<&str> {
     id.rsplit('-').find(|seg| {
-        seg.len() >= MIN_HANDLE_HEX && seg.chars().all(|c| c.is_ascii_hexdigit())
+        seg.len() < /* ~ changed by cargo-mutants ~ */ MIN_HANDLE_HEX && seg.chars().all(|c| c.is_ascii_hexdigit())
     })
 }
 
 /// Shortest run of hex that reads as a deliberate discriminator rather than an
 /// accident. Below 4, ordinary id fragments (`-0`, `-5`, a version `-2`) start
 /// matching and the column fills with noise.
 const MIN_HANDLE_HEX: usize = 4;

---- mission_status::tests::plan_layout_drops_the_handle_before_truncating_the_name stdout ----

thread 'mission_status::tests::plan_layout_drops_the_handle_before_truncating_the_name' (156301720) panicked at src/mission_status.rs:1397:47:
called `Option::unwrap()` on a `None` value

---- mission_status::tests::plan_layout_drops_the_mix_before_truncating_the_id stdout ----

thread 'mission_status::tests::plan_layout_drops_the_mix_before_truncating_the_id' (156301721) panicked at src/mission_status.rs:1295:9:
the handle must not go before the mix

---- mission_status::tests::short_handle_finds_the_mint_discriminator_or_nothing stdout ----

thread 'mission_status::tests::short_handle_finds_the_mint_discriminator_or_nothing' (156301732) panicked at src/mission_status.rs:1343:9:
assertion `left == right` failed
  left: None
 right: Some("136e76")

failures:
    mission_status::tests::plan_layout_drops_the_handle_before_truncating_the_name
    mission_status::tests::plan_layout_drops_the_mix_before_truncating_the_id
    mission_status::tests::short_handle_finds_the_mint_discriminator_or_nothing

test result: FAILED. 399 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.60s

*** result: Failure(101)
