*** src/mission_status.rs:166:37: replace && with || in short_handle

*** mutation diff:
--- src/mission_status.rs
+++ replace && with || in short_handle
@@ -158,17 +158,17 @@
 ///
 /// So: scan segments right-to-left for the first all-hex run of at least
 /// `MIN_HANDLE_HEX` chars. A HEURISTIC, deliberately — the two formats are not
 /// one, and hand-authored ids (`doom-loop-m4`, `104-daemon-observability`) match
 /// nothing and correctly yield `None`. It is display-only and drops to nothing
 /// on no match, so a wrong guess costs a column, never correctness.
 fn short_handle(id: &str) -> Option<&str> {
     id.rsplit('-').find(|seg| {
-        seg.len() >= MIN_HANDLE_HEX && seg.chars().all(|c| c.is_ascii_hexdigit())
+        seg.len() >= MIN_HANDLE_HEX || /* ~ changed by cargo-mutants ~ */ seg.chars().all(|c| c.is_ascii_hexdigit())
     })
 }
 
 /// Shortest run of hex that reads as a deliberate discriminator rather than an
 /// accident. Below 4, ordinary id fragments (`-0`, `-5`, a version `-2`) start
 /// matching and the column fills with noise.
 const MIN_HANDLE_HEX: usize = 4;

---- mission_status::tests::plan_layout_plans_no_handle_column_when_no_row_has_one stdout ----

thread 'mission_status::tests::plan_layout_plans_no_handle_column_when_no_row_has_one' (156299391) panicked at src/mission_status.rs:1422:9:
assertion failed: !l.show_handle

---- mission_status::tests::short_handle_finds_the_mint_discriminator_or_nothing stdout ----

thread 'mission_status::tests::short_handle_finds_the_mint_discriminator_or_nothing' (156299400) panicked at src/mission_status.rs:1345:9:
assertion `left == right` failed
  left: Some("0")
 right: Some("5d6a")

failures:
    mission_status::tests::plan_layout_plans_no_handle_column_when_no_row_has_one
    mission_status::tests::short_handle_finds_the_mint_discriminator_or_nothing

test result: FAILED. 400 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.55s

*** result: Failure(101)
