*** src/mission_status.rs:182:5: replace relative_age -> String with "xyzzy".into()

*** mutation diff:
--- src/mission_status.rs
+++ replace relative_age -> String with "xyzzy".into()
@@ -174,24 +174,17 @@
 
 /// (#1612) Compact "how long ago", in at most `AGE_COLS` columns.
 ///
 /// One unit, never two — `3d` not `3d 4h`. The board answers "what needs me
 /// now"; the difference between 3d and 3d4h has never changed that answer, and
 /// the second unit costs the columns the name needs. Rounds DOWN, so a row
 /// never claims to be older than it is.
 fn relative_age(now: u64, then: u64) -> String {
-    let secs = now.saturating_sub(then);
-    match secs {
-        0..=59 => "now".to_string(),
-        60..=3_599 => format!("{}m", secs / 60),
-        3_600..=86_399 => format!("{}h", secs / 3_600),
-        86_400..=2_591_999 => format!("{}d", secs / 86_400),
-        _ => format!("{}w", secs / 604_800),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Pure drift detection for one mission given its phases. `now` and
 /// `stale_days` are passed in (rather than read internally) so the function
 /// stays IO-free and unit-testable with fixed timestamps — see the module
 /// doc. Load-bearing inconsistencies:
 ///   - an ACTIVE/PAUSED mission whose phases are ALL terminal with at least
 ///     one complete — done, just never finalized.

---- mission_status::tests::relative_age_is_one_unit_and_fits_its_column stdout ----

thread 'mission_status::tests::relative_age_is_one_unit_and_fits_its_column' (156306452) panicked at src/mission_status.rs:1352:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "now"

failures:
    mission_status::tests::relative_age_is_one_unit_and_fits_its_column

test result: FAILED. 401 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.04s

*** result: Failure(101)
