*** src/mission_status.rs:184:9: delete match arm 0..= 59 in relative_age

*** mutation diff:
--- src/mission_status.rs
+++ delete match arm 0..= 59 in relative_age
@@ -176,17 +176,17 @@
 ///
 /// One unit, never two — `3d` not `3d 4h`. The board answers "what needs me
 /// now"; the difference between 3d and 3d4h has never changed that answer, and
 /// the second unit costs the columns the name needs. Rounds DOWN, so a row
 /// never claims to be older than it is.
 fn relative_age(now: u64, then: u64) -> String {
     let secs = now.saturating_sub(then);
     match secs {
-        0..=59 => "now".to_string(),
+         /* ~ changed by cargo-mutants ~ */
         60..=3_599 => format!("{}m", secs / 60),
         3_600..=86_399 => format!("{}h", secs / 3_600),
         86_400..=2_591_999 => format!("{}d", secs / 86_400),
         _ => format!("{}w", secs / 604_800),
     }
 }
 
 /// Pure drift detection for one mission given its phases. `now` and

---- mission_status::tests::relative_age_is_one_unit_and_fits_its_column stdout ----

thread 'mission_status::tests::relative_age_is_one_unit_and_fits_its_column' (156308874) panicked at src/mission_status.rs:1359:9:
assertion `left == right` failed
  left: "0w"
 right: "now"

failures:
    mission_status::tests::relative_age_is_one_unit_and_fits_its_column

test result: FAILED. 401 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.58s

*** result: Failure(101)
