*** src/mission_status.rs:187:9: delete match arm 86_400..= 2_591_999 in relative_age

*** mutation diff:
--- src/mission_status.rs
+++ delete match arm 86_400..= 2_591_999 in relative_age
@@ -179,17 +179,17 @@
 /// the second unit costs the columns the name needs. Rounds DOWN, so a row
 /// never claims to be older than it is.
 fn relative_age(now: u64, then: u64) -> String {
     let secs = now.saturating_sub(then);
     match secs {
         0..=59 => "now".to_string(),
         60..=3_599 => format!("{}m", secs / 60),
         3_600..=86_399 => format!("{}h", secs / 3_600),
-        86_400..=2_591_999 => format!("{}d", secs / 86_400),
+         /* ~ changed by cargo-mutants ~ */
         _ => format!("{}w", secs / 604_800),
     }
 }
 
 /// Pure drift detection for one mission given its phases. `now` and
 /// `stale_days` are passed in (rather than read internally) so the function
 /// stays IO-free and unit-testable with fixed timestamps — see the module
 /// doc. Load-bearing inconsistencies:

---- mission_status::tests::relative_age_is_one_unit_and_fits_its_column stdout ----

thread 'mission_status::tests::relative_age_is_one_unit_and_fits_its_column' (156316136) panicked at src/mission_status.rs:1365:9:
assertion `left == right` failed
  left: "0w"
 right: "1d"

failures:
    mission_status::tests::relative_age_is_one_unit_and_fits_its_column

test result: FAILED. 401 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.99s

*** result: Failure(101)
