*** src/skills.rs:157:9: delete field source from struct InstallReport expression in install_skills

*** mutation diff:
--- src/skills.rs
+++ delete field source from struct InstallReport expression in install_skills
@@ -149,17 +149,17 @@
 
 pub fn install_skills(opts: &InstallOptions) -> Result<InstallReport> {
     let targets = match &opts.target {
         Some(p) => vec![p.clone()],
         None => default_skills_targets()?,
     };
 
     let mut report = InstallReport {
-        source: PathBuf::new(),
+         /* ~ changed by cargo-mutants ~ */
         targets: targets.clone(),
         ..Default::default()
     };
 
     let source = locate_on_disk_skills_source();
     report.source = source.clone().unwrap_or_else(|| PathBuf::from("<embedded>"));
 
     for target in &targets {

*** result: Timeout
