*** src/skills.rs:158:9: delete field targets from struct InstallReport expression in install_skills

*** mutation diff:
--- src/skills.rs
+++ delete field targets from struct InstallReport expression in install_skills
@@ -150,17 +150,17 @@
 pub fn install_skills(opts: &InstallOptions) -> Result<InstallReport> {
     let targets = match &opts.target {
         Some(p) => vec![p.clone()],
         None => default_skills_targets()?,
     };
 
     let mut report = InstallReport {
         source: PathBuf::new(),
-        targets: targets.clone(),
+         /* ~ changed by cargo-mutants ~ */
         ..Default::default()
     };
 
     let source = locate_on_disk_skills_source();
     report.source = source.clone().unwrap_or_else(|| PathBuf::from("<embedded>"));
 
     for target in &targets {
         if !opts.dry_run && !target.exists() {

*** result: Timeout
