*** src/skills.rs:301:9: delete field source from struct InstallReport expression in install_from_disk

*** mutation diff:
--- src/skills.rs
+++ delete field source from struct InstallReport expression in install_from_disk
@@ -293,17 +293,17 @@
 }
 
 fn install_from_disk(
     source: &Path,
     target: &Path,
     opts: &InstallOptions,
 ) -> Result<InstallReport> {
     let mut report = InstallReport {
-        source: source.to_path_buf(),
+         /* ~ changed by cargo-mutants ~ */
         targets: vec![target.to_path_buf()],
         ..Default::default()
     };
 
     for entry in fs::read_dir(source)
         .with_context(|| format!("reading {}", source.display()))?
     {
         let entry = entry?;

*** result: Timeout
