*** src/skills.rs:361:9: delete field targets from struct InstallReport expression in install_from_embedded

*** mutation diff:
--- src/skills.rs
+++ delete field targets from struct InstallReport expression in install_from_embedded
@@ -353,17 +353,17 @@
     }
 
     Ok(report)
 }
 
 fn install_from_embedded(target: &Path, opts: &InstallOptions) -> Result<InstallReport> {
     let mut report = InstallReport {
         source: PathBuf::from("<embedded>"),
-        targets: vec![target.to_path_buf()],
+         /* ~ changed by cargo-mutants ~ */
         ..Default::default()
     };
 
     for (skill_name, body) in EMBEDDED_SKILLS {
         let dst_skill_dir = target.join(skill_name);
         let dst_skill_md = dst_skill_dir.join("SKILL.md");
 
         let already_exists = dst_skill_md.exists();

*** result: Success
